# ConnectionValidationInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionValidationInfo Methods
ConnectionValidationInfo Class See Also
---
The ConnectionValidationInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWarning | Access specific warning number of warnings generated by reload. |
| IsValidWarningIndex | Validate warning index. |
| ManyWarnings | Returns number of warnings generated by reload. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace